#pragma once
#include <windows.h>
#include <algorithm>
#include <locale>
#include <stdlib.h>
#include <xlocale>
#include <ctype.h>
#include <chrono>
#include <thread>
#include <vector>
#include <string>
#include <map>

/*
# ========================================================================================= #
# Flags
# ========================================================================================= #
*/

// https://github.com/CodeRedModding/UnrealEngine3/blob/main/Development/Src/Core/Inc/UnStack.h#L48
// State Flags
enum EStateFlags
{
	STATE_Editable =						0x00000001,	// State should be user-selectable in UnrealEd.
	STATE_Auto =							0x00000002,	// State is automatic (the default state).
	STATE_Simulated =						0x00000004, // State executes on client side.
	STATE_HasLocals =						0x00000008,	// State has local variables.
};

// https://github.com/CodeRedModding/UnrealEngine3/blob/main/Development/Src/Core/Inc/UnStack.h#L60
// Function Flags
enum EFunctionFlags : uint64_t
{
	FUNC_None =								0x00000000,
	FUNC_Final =							0x00000001,
	FUNC_Defined =							0x00000002,
	FUNC_Iterator =							0x00000004,
	FUNC_Latent =							0x00000008,
	FUNC_PreOperator =						0x00000010,
	FUNC_Singular =							0x00000020,
	FUNC_Net =								0x00000040,
	FUNC_NetReliable =						0x00000080,
	FUNC_Simulated =						0x00000100,
	FUNC_Exec =								0x00000200,
	FUNC_Native =							0x00000400,
	FUNC_Event =							0x00000800,
	FUNC_Operator =							0x00001000,

	CLASS_IsAUProperty =					0x00008000,
	CLASS_IsAUObjectProperty =				0x00010000,
	CLASS_IsAUBoolProperty =				0x00020000,
	CLASS_IsAUState =						0x00040000,
	CLASS_IsAUFunction =					0x00080000,
	CLASS_IsAUStructProperty =				0x00100000,

	// Flags to inherit from base class.
	CLASS_Inherit =							(CLASS_Transient | CLASS_Config | CLASS_Localized | CLASS_SafeReplace | CLASS_PerObjectConfig | CLASS_PerObjectLocalized | CLASS_Placeable | CLASS_IsAUProperty | CLASS_IsAUObjectProperty | CLASS_IsAUBoolProperty | CLASS_IsAUStructProperty | CLASS_IsAUState | CLASS_IsAUFunction | CLASS_HasComponents | CLASS_Deprecated | CLASS_Intrinsic | CLASS_HasInstancedProps | CLASS_HasCrossLevelRefs),

	// These flags will be cleared by the compiler when the class is parsed during script compilation.
	CLASS_RecompilerClear =					(CLASS_Inherit | CLASS_Abstract | CLASS_NoExport | CLASS_NativeReplication | CLASS_Native),

	// These flags will be inherited from the base class only for non-intrinsic classes.
	CLASS_ScriptInherit =					(CLASS_Inherit | CLASS_EditInlineNew | CLASS_CollapseCategories),

	CLASS_AllFlags =						0xFFFFFFFF,
};

// https://github.com/CodeRedModding/UnrealEngine3/blob/7bf53e29f620b0d4ca5c9bd063a2d2dbcee732fe/Development/Src/Core/Inc/UnObjBas.h#L195
// Class Cast Flags
enum EClassCastFlag : uint32_t
{
	CASTCLASS_None =						0x00000000,
	CASTCLASS_UField =						0x00000001,
	CASTCLASS_UConst =						0x00000002,
	CASTCLASS_UEnum =						0x00000004,
	CASTCLASS_UStruct =						0x00000008,
	CASTCLASS_UScriptStruct =				0x00000010,
	CASTCLASS_UClass =						0x00000020,
	CASTCLASS_UByteProperty =				0x00000040,
	CASTCLASS_UIntProperty =				0x00000080,
	CASTCLASS_UFloatProperty =				0x00000100,
	CASTCLASS_UComponentProperty =			0x00000200,
	CASTCLASS_UClassProperty =				0x00000400,
	CASTCLASS_UInterfaceProperty =			0x00001000,
	CASTCLASS_UNameProperty =				0x00002000,
	CASTCLASS_UStrProperty =				0x00004000,

	// These match the values of the old class flags to make conversion easier.
	CASTCLASS_UProperty =					0x00008000,
	CASTCLASS_UObjectProperty =				0x00010000,
	CASTCLASS_UBoolProperty =				0x00020000,
	CASTCLASS_UState =						0x00040000,
	CASTCLASS_UFunction =					0x00080000,
	CASTCLASS_UStructProperty =				0x00100000,

	CASTCLASS_UArrayProperty =				0x00200000,
	CASTCLASS_UMapProperty =				0x00400000,
	CASTCLASS_UDelegateProperty =			0x00800000,
	CASTCLASS_UComponent =					0x01000000,

	CASTCLASS_AllFlags =					0xFFFFFFFF,
};

/*
# ========================================================================================= #
# Globals
# ========================================================================================= #
*/

// GObjects
#define GObjects_Offset		(uintptr_t)0x1023630
// GNames
#define GNames_Offset		(uintptr_t)0x1035674

/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

template<typename TArray>
class TIterator
{
public:
	using ElementType = typename TArray::ElementType;
	using ElementPointer = ElementType*;
	using ElementReference = ElementType&;
	using ElementConstReference = const ElementType&;

private:
	ElementPointer IteratorData;

public:
	TIterator(ElementPointer inElementPointer) : IteratorData(inElementPointer) {}

	~TIterator() {}

public:
	TIterator& operator++()
	{
		IteratorData++;
		return *this;
	}

	TIterator operator++(int32_t)
	{
		TIterator iteratorCopy = *this;
		++(*this);
		return iteratorCopy;
	}

	TIterator& operator--()
	{
		IteratorData--;
		return *this;
	}

	TIterator operator--(int32_t)
	{
		TIterator iteratorCopy = *this;
		--(*this);
		return iteratorCopy;
	}

	ElementReference operator[](int32_t index)
	{
		return *(IteratorData[index]);
	}

	ElementPointer operator->()
	{
		return IteratorData;
	}

	ElementReference operator*()
	{
		return *IteratorData;
	}

public:
	bool operator==(const TIterator& other) const
	{
		return (IteratorData == other.IteratorData);
	}

	bool operator!=(const TIterator& other) const
	{
		return !(*this == other);
	}
};

template<typename InElementType>
class TArray
{
public:
	using ElementType = InElementType;
	using ElementPointer = ElementType*;
	using ElementReference = ElementType&;
	using ElementConstPointer = const ElementType*;
	using ElementConstReference = const ElementType&;
	using Iterator = TIterator<TArray<ElementType>>;

private:
	ElementPointer ArrayData;
	int32_t ArrayCount;
	int32_t ArrayMax;

public:
	TArray() : ArrayData(nullptr), ArrayCount(0), ArrayMax(0)
	{
		//ReAllocate(sizeof(ElementType));
	}

	~TArray()
	{
		//clear();
		//::operator delete(ArrayData, ArrayMax * sizeof(ElementType));
	}

public:
	ElementConstReference operator[](int32_t index) const
	{
		return ArrayData[index];
	}

	ElementReference operator[](int32_t index)
	{
		return ArrayData[index];
	}

	ElementConstReference at(int32_t index) const
	{
		return ArrayData[index];
	}

	ElementReference at(int32_t index)
	{
		return ArrayData[index];
	}

	ElementConstPointer data() const
	{
		return ArrayData;
	}

	void push_back(ElementConstReference newElement)
	{
		if (ArrayCount >= ArrayMax)
		{
			ReAllocate(sizeof(ElementType) * (ArrayCount + 1));
		}

		new(&ArrayData[ArrayCount]) ElementType(newElement);
		ArrayCount++;
	}

	void push_back(ElementReference& newElement)
	{
		if (ArrayCount >= ArrayMax)
		{
			ReAllocate(sizeof(ElementType) * (ArrayCount + 1));
		}

		new(&ArrayData[ArrayCount]) ElementType(newElement);
		ArrayCount++;
	}

	void pop_back()
	{
		if (ArrayCount > 0)
		{
			ArrayCount--;
			ArrayData[ArrayCount].~ElementType();
		}
	}

	void clear()
	{
		for (int32_t i = 0; i < ArrayCount; i++)
		{
			ArrayData[i].~ElementType();
		}

		ArrayCount = 0;
	}

	int32_t size() const
	{
		return ArrayCount;
	}

	int32_t capacity() const
	{
		return ArrayMax;
	}

	bool empty() const
	{
		if (ArrayData)
		{
			return (size() == 0);
		}

		return true;
	}

	Iterator begin()
	{
		return Iterator(ArrayData);
	}

	Iterator end()
	{
		return Iterator(ArrayData + ArrayCount);
	}

	std::vector<InElementType> vector() {
		if (!ArrayData || ArrayCount == 0) {
			return {};
		}
		return std::vector<InElementType>(ArrayData, ArrayData + ArrayCount);
	}

private:
	void ReAllocate(int32_t newArrayMax)
	{
		ElementPointer newArrayData = (ElementPointer)::operator new(newArrayMax * sizeof(ElementType));
		int32_t newNum = ArrayCount;

		if (newArrayMax < newNum)
		{
			newNum = newArrayMax;
		}

		for (int32_t i = 0; i < newNum; i++)
		{
			new(newArrayData + i) ElementType(std::move(ArrayData[i]));
		}

		for (int32_t i = 0; i < ArrayCount; i++)
		{
			ArrayData[i].~ElementType();
		}

		::operator delete(ArrayData, ArrayMax * sizeof(ElementType));
		ArrayData = newArrayData;
		ArrayMax = newArrayMax;
	}
};

template<typename TKey, typename TValue>
class TMap
{
private:
	struct TPair
	{
		TKey Key;
		TValue Value;
		int32_t* HashNext;
	};

public:
	using ElementType = TPair;
	using ElementPointer = ElementType*;
	using ElementReference = ElementType&;
	using ElementConstReference = const ElementType&;
	using Iterator = TIterator<class TArray<ElementType>>;

public:
	class TArray<ElementType> Elements;								// 0x0000 (0x000C)
	struct FPointer IndirectData;									// 0x000C (0x0004)
	int32_t InlineData[0x4];										// 0x0010 (0x0010)
	int32_t NumBits;												// 0x0020 (0x0004)
	int32_t MaxBits;												// 0x0024 (0x0004)
	int32_t FirstFreeIndex;											// 0x0028 (0x0004)
	int32_t NumFreeIndices;											// 0x002C (0x0004)
	struct FPointer Hash;											// 0x0030 (0x0004)
	int32_t InlineHash;												// 0x0034 (0x0004)
	int32_t HashSize;												// 0x0038 (0x0004)

public:
	TMap() :
		IndirectData(NULL),
		NumBits(0),
		MaxBits(0),
		FirstFreeIndex(0),
		NumFreeIndices(0),
		Hash(nullptr),
		InlineHash(0),
		HashSize(0)
	{

	}

	TMap(struct FMap_Mirror& other) :
		IndirectData(NULL),
		NumBits(0),
		MaxBits(0),
		FirstFreeIndex(0),
		NumFreeIndices(0),
		Hash(nullptr),
		InlineHash(0),
		HashSize(0)
	{
		assign(other);
	}

	TMap(const TMap<TKey, TValue>& other) :
		IndirectData(NULL),
		NumBits(0),
		MaxBits(0),
		FirstFreeIndex(0),
		NumFreeIndices(0),
		Hash(nullptr),
		InlineHash(0),
		HashSize(0)
	{
		assign(other);
	}

	~TMap() {}

public:
	TMap<TKey, TValue>& assign(struct FMap_Mirror& other)
	{
		*this = *reinterpret_cast<TMap<TKey, TValue>*>(&other);
		return *this;
	}

	TMap<TKey, TValue>& assign(const TMap<TKey, TValue>& other)
	{
		Elements = other.Elements;
		IndirectData = other.IndirectData;
		InlineData[0] = other.InlineData[0];
		InlineData[1] = other.InlineData[1];
		InlineData[2] = other.InlineData[2];
		InlineData[3] = other.InlineData[3];
		NumBits = other.NumBits;
		MaxBits = other.MaxBits;
		FirstFreeIndex = other.FirstFreeIndex;
		NumFreeIndices = other.NumFreeIndices;
		Hash = other.Hash;
		InlineHash = other.InlineHash;
		HashSize = other.HashSize;
		return *this;
	}

	TValue& at(const TKey& key)
	{
		for (TPair& pair : Elements)
		{
			if (pair.Key == key)
			{
				return pair.Value;
			}
		}
	}

	const TValue& at(const TKey& key) const
	{
		for (const TPair& pair : Elements)
		{
			if (pair.Key == key)
			{
				return pair.Value;
			}
		}
	}

	TPair& at_index(int32_t index)
	{
		return Elements[index];
	}

	const TPair& at_index(int32_t index) const
	{
		return Elements[index];
	}

	int32_t size() const
	{
		return Elements.size();
	}

	int32_t capacity() const
	{
		return Elements.capacity();
	}

	bool empty() const
	{
		return Elements.empty();
	}

	Iterator begin()
	{
		return Elements.begin();
	}

	Iterator end()
	{
		return Elements.end();
	}

public:
	TValue& operator[](const TKey& key)
	{
		return at(key);
	}

	const TValue& operator[](const TKey& key) const
	{
		return at(key);
	}

	TMap<TKey, TValue>& operator=(const struct FMap_Mirror& other)
	{
		return assign(other);
	}

	TMap<TKey, TValue>& operator=(const TMap<TKey, TValue>& other)
	{
		return assign(other);
	}
};

extern class TArray<class UObject*>* GObjects;
extern class TArray<class FNameEntry*>* GNames;

/*
# ========================================================================================= #
# Structs
# ========================================================================================= #
*/

class FNameEntry
{
public:
	uint64_t Flags; // 0x0000 (0x0008)
	int32_t Index; // 0x0008 (0x0004)
	class FNameEntry* HashNext; // 0x000C (0x0004)
	char Name[0x400]; // 0x0010 (0x0001)

public:
	FNameEntry() : Flags(0), Index(-1), HashNext(nullptr) {}
	~FNameEntry() {}

public:
	uint64_t GetFlags() const
	{
		return Flags;
	}

	int32_t GetIndex() const
	{
		return Index;
	}

	const char* GetAnsiName() const
	{
		return Name;
	}

	std::string ToString() const
	{
		return std::string(Name);
	}
};

class FName
{
public:
	using ElementType = const char;
	using ElementPointer = ElementType*;

private:
	int32_t			FNameEntryId;									// 0x0000 (0x04)
	int32_t			InstanceNumber;									// 0x0004 (0x04)

public:
	FName() : FNameEntryId(-1), InstanceNumber(0) {}

	FName(int32_t id) : FNameEntryId(id), InstanceNumber(0) {}

	FName(ElementPointer nameToFind) : FNameEntryId(-1), InstanceNumber(0)
	{
		static std::vector<int32_t> nameCache{};

		for (int32_t entryId : nameCache)
		{
			if (Names()->at(entryId))
			{
				if (strcmp(Names()->at(entryId)->Name, nameToFind) == 0)
				{
					FNameEntryId = entryId;
					return;
				}
			}
		}

